# GridEndSegmentsLength Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..GridEndSegmentsLength Property
ParameterTypeId Class See Also
---
"End Segments Length"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId GridEndSegmentsLength { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GridEndSegmentsLength As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ GridEndSegmentsLength {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace